fdmxfarhan/ikiurobotic/SRC/test-02 New PCB ATWork 2023/STM32_Main/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define INA2_Pin GPIO_PIN_12
#define INA2_GPIO_Port GPIOB
#define INB2_Pin GPIO_PIN_13
#define INB2_GPIO_Port GPIOB
#define INA1_Pin GPIO_PIN_14
#define INA1_GPIO_Port GPIOB
#define INB1_Pin GPIO_PIN_15
#define INB1_GPIO_Port GPIOB
#define INA3_Pin GPIO_PIN_11
#define INA3_GPIO_Port GPIOA
#define INB3_Pin GPIO_PIN_12
#define INB3_GPIO_Port GPIOA
#define MOTORS_EN_Pin GPIO_PIN_3
#define MOTORS_EN_GPIO_Port GPIOB
#define INA4_Pin GPIO_PIN_4
#define INA4_GPIO_Port GPIOB
#define INB4_Pin GPIO_PIN_5
#define INB4_GPIO_Port GPIOB
#define PWM1_Pin GPIO_PIN_6
#define PWM1_GPIO_Port GPIOB
#define PWM2_Pin GPIO_PIN_7
#define PWM2_GPIO_Port GPIOB
#define PWM3_Pin GPIO_PIN_8
#define PWM3_GPIO_Port GPIOB
#define PWM4_Pin GPIO_PIN_9
#define PWM4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
